W8/redditclone/app/controllers/subs_controller.rb

INSERT INTO "subs" ("title", "description", "moderator", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Cute Animals"], ["description", "The cutest animals only."], ["moderator", "Lauren"], ["created_at", "2020-06-29 21:15:27.114165"], ["updated_at", "2020-06-29 21:15:27.114165"]]
---
    def create
        @sub = Sub.new(sub_params)
        @sub.moderator = current_user.username

        if @sub.save