W11/benchbnb/app/controllers/api/users_controller.rb

    def create
        @user = User.new(user_params)
        if @user.save
---
INSERT INTO "users" ("username", "session_token", "password_digest") VALUES ($1, $2, $3) RETURNING "id"  [["username", "cade123"], ["session_token", "9O-1usWr1zSJhMakbDeqvg"], ["password_digest", "$2a$12$PR7ifFyBL7R9cLqcWyDcV.7CT/JMnw7jBxuggswjfN49ql7RnTRQ."]]